Koxx3/SmartESC_STM32_v2/m365/Src/TTerm.c
void TERM_printBootMessage(TERMINAL_HANDLE * handle){
    TERM_sendVT100Code(handle, _VT100_RESET, 0); TERM_sendVT100Code(handle, _VT100_CURSOR_POS1, 0); TERM_sendVT100Code(handle, _VT100_WRAP_OFF, 0);
    ttprintfEcho("\r\n\n\n%s\r\n", TERM_startupText1);
    ttprintfEcho("%s\r\n", TERM_startupText2);
    ttprintfEcho("%s\r\n", TERM_startupText3);
}

BaseType_t ptr_is_in_ram(void* ptr){
    if(ptr > (void*)START_OF_FLASH && ptr < (void*)END_OF_FLASH){
        return pdFALSE;
    }
    return pdTRUE;
}

uint8_t TERM_defaultErrorPrinter(TERMINAL_HANDLE * handle, uint32_t retCode){
    switch(retCode){
        case TERM_CMD_EXIT_SUCCESS:
            ttprintfEcho("\r\n%s@%s>", handle->currUserName, TERM_DEVICE_NAME);
            break;

        case TERM_CMD_EXIT_ERROR:
            ttprintfEcho("\r\nTask returned with error code %d\r\n%s@%s>", retCode, handle->currUserName, TERM_DEVICE_NAME);
            break;

        case TERM_CMD_EXIT_NOT_FOUND:
            ttprintfEcho("\"%s\" is not a valid command. Type \"help\" to see a list of available ones\r\n%s@%s>", handle->inputBuffer, handle->currUserName, TERM_DEVICE_NAME);
            break;
    }
    return TERM_CMD_EXIT_SUCCESS;
}

uint8_t TERM_handleInput(uint16_t c, TERMINAL_HANDLE * handle){
    if(handle->currProgram != NULL){
        //call the handler of the current override
        //uint8_t currRetCode = (*handle->currProgram->inputHandler)(handle, c);
        
        (*handle->errorPrinter)(handle, TERM_CMD_EXIT_NOT_FOUND);
        
        if(c == 0x03){
            ttprintfEcho("^C");
        }
        return 1;
    }
    
    switch(c){
        case '\r':      //enter
            TERM_checkForCopy(handle, TERM_CHECK_COMP_AND_HIST);
            
            if(handle->currBufferLength != 0){
                ttprintfEcho("\r\n", handle->inputBuffer);

                if(handle->historyBuffer[handle->currHistoryWritePosition] != 0){
                    vPortFree(handle->historyBuffer[handle->currHistoryWritePosition]);
                    handle->historyBuffer[handle->currHistoryWritePosition] = 0;
                }

                handle->historyBuffer[handle->currHistoryWritePosition] = pvPortMalloc(handle->currBufferLength + 1);
                memcpy(handle->historyBuffer[handle->currHistoryWritePosition], handle->inputBuffer, handle->currBufferLength + 1);
                
                if(++handle->currHistoryWritePosition >= TERM_HISTORYSIZE) handle->currHistoryWritePosition = 0;
                
                handle->currHistoryReadPosition = handle->currHistoryWritePosition;

                uint8_t retCode = TERM_interpretCMD(handle->inputBuffer, handle->currBufferLength, handle);
                (*handle->errorPrinter)(handle, retCode);
                
                handle->currBufferPosition = 0;
                handle->currBufferLength = 0;
                handle->inputBuffer[handle->currBufferPosition] = 0;
            }else{
                ttprintfEcho("\r\n%s@%s>", handle->currUserName, TERM_DEVICE_NAME);
            }       
            break;
            
        case 0x03:      //CTRL+c
            //TODO reset current buffer
            ttprintfEcho("^C");
            break;
            
        case 0x08:      //backspace (used by xTerm)
        case 0x7f:      //DEL       (used by hTerm)
            TERM_checkForCopy(handle, TERM_CHECK_COMP_AND_HIST);
            if(handle->currBufferPosition == 0) break;
            
            if(handle->inputBuffer[handle->currBufferPosition] != 0){      //check if we are at the end of our command
                //we are somewhere in the middle -> move back existing characters
                strsft(handle->inputBuffer, handle->currBufferPosition - 1, -1);    
                ttprintfEcho("\x08");   
                TERM_sendVT100Code(handle, _VT100_ERASE_LINE_END, 0);
                ttprintfEcho("%s", &handle->inputBuffer[handle->currBufferPosition - 1]);
                TERM_sendVT100Code(handle, _VT100_CURSOR_BACK_BY, handle->currBufferLength - handle->currBufferPosition);
                handle->currBufferPosition --;
                handle->currBufferLength --;
            }else{
                //we are somewhere at the end -> just delete the current one
                handle->inputBuffer[--handle->currBufferPosition] = 0;
                ttprintfEcho("\x08 \x08");           
                handle->currBufferLength --;
            }
            break;
            
        case _VT100_KEY_END:
            TERM_checkForCopy(handle, TERM_CHECK_COMP_AND_HIST);
            //TODO move cursor to EOL
            break;
            
        case _VT100_KEY_POS1:
            TERM_checkForCopy(handle, TERM_CHECK_COMP_AND_HIST);
            //TODO move cursor to BOL
            break;
            
        case _VT100_CURSOR_FORWARD:
            TERM_checkForCopy(handle, TERM_CHECK_COMP_AND_HIST);
            
            if(handle->currBufferPosition < handle->currBufferLength){
                handle->currBufferPosition ++;
                TERM_sendVT100Code(handle, _VT100_CURSOR_FORWARD, 0);
            }
            break;
            
        case _VT100_CURSOR_BACK:
            TERM_checkForCopy(handle, TERM_CHECK_COMP_AND_HIST);
            
            if(handle->currBufferPosition > 0){
                handle->currBufferPosition --;
                TERM_sendVT100Code(handle, _VT100_CURSOR_BACK, 0);
            }
            break;
            
        case _VT100_CURSOR_UP:
            TERM_checkForCopy(handle, TERM_CHECK_COMP);
            
            do{
                if(--handle->currHistoryReadPosition >= TERM_HISTORYSIZE) handle->currHistoryReadPosition = TERM_HISTORYSIZE - 1;
                
                if(handle->historyBuffer[handle->currHistoryReadPosition] != 0){
                    break;
                }
            }while(handle->currHistoryReadPosition != handle->currHistoryWritePosition);
            
            //print out the command at the current history read position
            if(handle->currHistoryReadPosition == handle->currHistoryWritePosition){
                ttprintfEcho("\x07");   //rings a bell doesn't it?                                                      
                TERM_sendVT100Code(handle, _VT100_ERASE_LINE, 0);
                ttprintfEcho("\r%s@%s>%s", handle->currUserName, TERM_DEVICE_NAME, handle->inputBuffer);
            }else{
                TERM_sendVT100Code(handle, _VT100_ERASE_LINE, 0);
                ttprintfEcho("\r%s@%s>%s", handle->currUserName, TERM_DEVICE_NAME, handle->historyBuffer[handle->currHistoryReadPosition]);
            }
            break;
            
        case _VT100_CURSOR_DOWN:
            TERM_checkForCopy(handle, TERM_CHECK_COMP);
            
            while(handle->currHistoryReadPosition != handle->currHistoryWritePosition){
                if(++handle->currHistoryReadPosition >= TERM_HISTORYSIZE) handle->currHistoryReadPosition = 0;
                
                if(handle->historyBuffer[handle->currHistoryReadPosition] != 0){
                    break;
                }
            }
            
