Koxx3/SmartESC_STM32_v2/m365/Src/TTerm.c
            //print out the command at the current history read position
            if(handle->currHistoryReadPosition == handle->currHistoryWritePosition){
                ttprintfEcho("\x07");   //rings a bell doesn't it?                                                      
                TERM_sendVT100Code(handle, _VT100_ERASE_LINE, 0);
                ttprintfEcho("\r%s@%s>%s", handle->currUserName, TERM_DEVICE_NAME, handle->inputBuffer);
            }else{
                TERM_sendVT100Code(handle, _VT100_ERASE_LINE, 0);
                ttprintfEcho("\r%s@%s>%s", handle->currUserName, TERM_DEVICE_NAME, handle->historyBuffer[handle->currHistoryReadPosition]);
            }
            break;
            
        case '\t':      //tab
            TERM_checkForCopy(handle, TERM_CHECK_HIST);
            
            if(handle->autocompleteBuffer == NULL){ 
                TERM_doAutoComplete(handle);
            }
            
            if(++handle->currAutocompleteCount > handle->autocompleteBufferLength) handle->currAutocompleteCount = 0;
            
            if(handle->currAutocompleteCount == 0){
                ttprintfEcho("\x07");
                TERM_sendVT100Code(handle, _VT100_ERASE_LINE, 0);
                ttprintfEcho("\r%s@%s>%s", handle->currUserName, TERM_DEVICE_NAME, handle->inputBuffer);
            }else{
                TERM_sendVT100Code(handle, _VT100_ERASE_LINE, 0);
                unsigned printQuotationMarks = strchr(handle->autocompleteBuffer[handle->currAutocompleteCount - 1], ' ') != 0;
                ttprintfEcho(printQuotationMarks ? "\r%s@%s>%.*s\"%s\"" : "\r%s@%s>%.*s%s", handle->currUserName, TERM_DEVICE_NAME, handle->autocompleteStart, handle->inputBuffer, handle->autocompleteBuffer[handle->currAutocompleteCount - 1]);
            }
            break;
            
        case _VT100_BACKWARDS_TAB:
            TERM_checkForCopy(handle, TERM_CHECK_HIST);
            
            if(handle->autocompleteBuffer == NULL){ 
                TERM_doAutoComplete(handle);
            }
            
            if(--handle->currAutocompleteCount > handle->autocompleteBufferLength - 1) handle->currAutocompleteCount = handle->autocompleteBufferLength - 1;
            
            if(handle->currAutocompleteCount == 0){
                ttprintfEcho("\x07");
                TERM_sendVT100Code(handle, _VT100_ERASE_LINE, 0);
                ttprintfEcho("\r%s@%s>%s", handle->currUserName, TERM_DEVICE_NAME, handle->inputBuffer);
            }else{
                TERM_sendVT100Code(handle, _VT100_ERASE_LINE, 0);
                unsigned printQuotationMarks = strchr(handle->autocompleteBuffer[handle->currAutocompleteCount - 1], ' ') != 0;
                ttprintfEcho(printQuotationMarks ? "\r%s@%s>%.*s\"%s\"" : "\r%s@%s>%.*s%s", handle->currUserName, TERM_DEVICE_NAME, handle->autocompleteStart, handle->inputBuffer, handle->autocompleteBuffer[handle->currAutocompleteCount - 1]);
            }
            break;
            
        case _VT100_RESET:
            TERM_printBootMessage(handle);
            break;
           
        case 32 ... 126:
            TERM_checkForCopy(handle, TERM_CHECK_COMP_AND_HIST);
            
            //TODO check for string length overflow
            
            if(handle->inputBuffer[handle->currBufferPosition] != 0){      //check if we are at the end of our command
                strsft(handle->inputBuffer, handle->currBufferPosition, 1);   
                handle->inputBuffer[handle->currBufferPosition] = c; 
                TERM_sendVT100Code(handle, _VT100_ERASE_LINE_END, 0);
                ttprintfEcho("%s", &handle->inputBuffer[handle->currBufferPosition]);
                TERM_sendVT100Code(handle, _VT100_CURSOR_BACK_BY, handle->currBufferLength - handle->currBufferPosition);
                handle->currBufferLength ++;
                handle->currBufferPosition ++;
            }else{
                
                //we are at the end -> just delete the current one
                handle->inputBuffer[handle->currBufferPosition++] = c;
                handle->inputBuffer[handle->currBufferPosition] = 0;
                handle->currBufferLength ++;
                ttprintfEcho("%c", c);
            }
            break;
            
        default:
            TERM_printDebug(handle, "unknown code received: 0x%02x\r\n", c);
            break;
    }
    return TERM_CMD_EXIT_SUCCESS;
}

void TERM_checkForCopy(TERMINAL_HANDLE * handle, COPYCHECK_MODE mode){
    if((mode & TERM_CHECK_COMP) && handle->autocompleteBuffer != NULL){ 
        if(handle->currAutocompleteCount != 0){
            char * dst = (char *) ((uint32_t) handle->inputBuffer + handle->autocompleteStart);
            if(strchr(handle->autocompleteBuffer[handle->currAutocompleteCount - 1], ' ') != 0){
                sprintf(dst, "\"%s\"", handle->autocompleteBuffer[handle->currAutocompleteCount - 1]);
            }else{
                strcpy(dst, handle->autocompleteBuffer[handle->currAutocompleteCount - 1]);
            }
            handle->currBufferLength = strlen(handle->inputBuffer);
            handle->currBufferPosition = handle->currBufferLength;
            handle->inputBuffer[handle->currBufferPosition] = 0;
        }
        vPortFree(handle->autocompleteBuffer);
        handle->autocompleteBuffer = NULL;
    }
    
    if((mode & TERM_CHECK_HIST) && handle->currHistoryWritePosition != handle->currHistoryReadPosition){
        strcpy(handle->inputBuffer, handle->historyBuffer[handle->currHistoryReadPosition]);
        handle->currBufferLength = strlen(handle->inputBuffer);
        handle->currBufferPosition = handle->currBufferLength;
        handle->currHistoryReadPosition = handle->currHistoryWritePosition;
    }
}

char * strnchr(char * str, char c, uint32_t length){
    uint32_t currPos = 0;
    for(;currPos < length && str[currPos] != 0; currPos++){
        if(str[currPos] == c) return &str[currPos];
    }
    return NULL;
}

void strsft(char * src, int32_t startByte, int32_t offset){
    if(offset == 0) return;
    
