Koxx3/SmartESC_STM32_v2/m365/Src/TTerm.c
    if(offset > 0){     //shift forward
        uint32_t currPos = strlen(src) + offset;
        src[currPos--] = 0;
        for(; currPos >= startByte; currPos--){
            if(currPos == 0){
                src[currPos] = ' ';
                break;
            }
            src[currPos] = src[currPos - offset];
        }
        return;
    }else{              //shift backward
        uint32_t currPos = startByte;
        for(; src[currPos - offset] != 0; currPos++){
            src[currPos] = src[currPos - offset];
        }
        src[currPos] = src[currPos - offset];
        return;
    }
}

TermCommandDescriptor * TERM_findCMD(TERMINAL_HANDLE * handle){
    uint8_t currPos = 0;
    uint16_t cmdLength = handle->currBufferLength;
    
    char * firstSpace = strchr(handle->inputBuffer, ' ');
    if(firstSpace != 0){
        cmdLength = (uint16_t) ((uint32_t) firstSpace - (uint32_t) handle->inputBuffer);
    }
    
    TermCommandDescriptor * currCmd = handle->cmdListHead->nextCmd;
    for(;currPos < handle->cmdListHead->commandLength; currPos++){
        if(currCmd->commandLength == cmdLength && strncmp(handle->inputBuffer, currCmd->command, cmdLength) == 0) return currCmd;
        currCmd = currCmd->nextCmd;
    }
    
    return 0;
}

uint8_t TERM_interpretCMD(char * data, uint16_t dataLength, TERMINAL_HANDLE * handle){
    
    TermCommandDescriptor * cmd = TERM_findCMD(handle);
    
    if(cmd != 0){
        uint16_t argCount = TERM_countArgs(data, dataLength);
        if(argCount == TERM_ARGS_ERROR_STRING_LITERAL){
            ttprintfEcho("\r\nError: unclosed string literal in command\r\n");
            return TERM_CMD_EXIT_ERROR;
        }

        char ** args = 0;
        if(argCount != 0){
            args = pvPortMalloc(sizeof(char*) * argCount);
            TERM_seperateArgs(data, dataLength, args);
        }

        uint8_t retCode = TERM_CMD_EXIT_ERROR;
        if(cmd->function != 0){
            //configASSERT((cmd->function > 0x9d000000) && (cmd->function < 0x9d040000));
            retCode = (*cmd->function)(handle, argCount, args);
        }

        if(argCount != 0) vPortFree(args);
        return retCode;
    }
    
    return TERM_CMD_EXIT_NOT_FOUND;
}

uint16_t TERM_seperateArgs(char * data, uint16_t dataLength, char ** buff){
    uint8_t count = 0;
    uint8_t currPos = 0;
    unsigned quoteMark = 0;
    char * currStringStart = 0;
    char * lastSpace = 0;
    for(;currPos<dataLength; currPos++){
        switch(data[currPos]){
            case ' ':
                if(!quoteMark){
                    data[currPos] = 0;
                    lastSpace = &data[currPos + 1];
                }
                break;
                
            case '"':
                if(quoteMark){
                    quoteMark = 0;
                    if(currStringStart){
                        data[currPos] = 0;
                        buff[count++] = currStringStart;
                    }
                }else{
                    quoteMark = 1;
                    currStringStart = &data[currPos+1];
                }
                        
                break;
            default:
                if(!quoteMark){
                    if(lastSpace != 0){
                        buff[count++] = lastSpace;
                        lastSpace = 0;
                    }
                }
                break;
        }
    }
    if(quoteMark) return TERM_ARGS_ERROR_STRING_LITERAL;
    return count;
}

uint16_t TERM_countArgs(const char * data, uint16_t dataLength){
    uint8_t count = 0;
    uint8_t currPos = 0;
    unsigned quoteMark = 0;
    const char * currStringStart = NULL;
    const char * lastSpace = NULL;
    for(;currPos<dataLength; currPos++){
        switch(data[currPos]){
            case ' ':
                if(!quoteMark){
                    lastSpace = &data[currPos + 1];
                }
                break;
                
            case '"':
                if(quoteMark){
                    quoteMark = 0;
                    if(currStringStart){
                        count ++;
                    }
                }else{
                    quoteMark = 1;
                    currStringStart = &data[currPos+1];
                }
                        
                break;
            default:
                if(!quoteMark){
                    if(lastSpace){
                        count ++;
                        lastSpace = NULL;
                    }
                }
                break;
        }
    }
    if(quoteMark) return TERM_ARGS_ERROR_STRING_LITERAL;
    return count;
}

void TERM_freeCommandList(TermCommandDescriptor ** cl, uint16_t length){
    /*uint8_t currPos = 0;
    for(;currPos < length; currPos++){
        vPortFree(cl[currPos]);
    }*/
    vPortFree(cl);
}

TermCommandDescriptor * TERM_addCommand(TermCommandFunction function, const char * command, const char * description, uint8_t minPermissionLevel, TermCommandDescriptor * head){
    if(head->commandLength == 0xff) return 0;
    
    TermCommandDescriptor * newCMD = pvPortMalloc(sizeof(TermCommandDescriptor));
    
    newCMD->command = command;
    newCMD->commandDescription = description;
    newCMD->commandLength = strlen(command);
    newCMD->function = function;
    newCMD->minPermissionLevel = minPermissionLevel;
    newCMD->ACHandler = 0;
    
    TERM_LIST_add(newCMD, head);
    return newCMD;
}

void TERM_LIST_add(TermCommandDescriptor * item, TermCommandDescriptor * head){
    uint32_t currPos = 0;
    TermCommandDescriptor ** lastComp = &head->nextCmd;
    TermCommandDescriptor * currComp = head->nextCmd;
    
    while(currPos < head->commandLength){
        if(TERM_isSorted(currComp, item)){
            *lastComp = item;
            item->nextCmd = currComp;
            head->commandLength ++;
            
            return;
        }
        if(currComp->nextCmd == 0){
            item->nextCmd = currComp->nextCmd;
            currComp->nextCmd = item;
            head->commandLength ++;
            return;
        }
        lastComp = &currComp->nextCmd;
        currComp = currComp->nextCmd;
    }
    
    item->nextCmd = 0;
    *lastComp = item;
    head->commandLength ++;
}


unsigned TERM_isSorted(TermCommandDescriptor * a, TermCommandDescriptor * b){
    uint8_t currPos = 0;
    //compare the lowercase ASCII values of each character in the command (They are alphabetically sorted)
    for(;currPos < a->commandLength && currPos < b->commandLength; currPos++){
        char letterA = toLowerCase(a->command[currPos]);
        char letterB = toLowerCase(b->command[currPos]);
        //if the letters are different we return 1 if a is smaller than b (they are correctly sorted) or zero if its the other way around
        if(letterA > letterB){
            return 1;
        }else if(letterB > letterA){
            return 0;
        }
    }
    
    //the two commands have identical letters for their entire length we check which one is longer (the shortest should come first)
    if(a->commandLength > b->commandLength){
        return 1;
    }else if(b->commandLength > a->commandLength){
        return 0;
    }else{
        //it might happen that a command is added twice (or two identical ones are added), in which case we just say they are sorted correctly and print an error in the console
        //TODO implement an alarm here
        //UART_print("WARNING: Found identical commands: \"%S\" and \"%S\"\r\n", a->command, b->command);        
        return 1;
    }
}

char toLowerCase(char c){
    if(c > 65 && c < 90){
        return c + 32;
    }

    return c;
}

void TERM_Box(TERMINAL_HANDLE * handle, uint8_t row1, uint8_t col1, uint8_t row2, uint8_t col2) {
	TERM_setCursorPos(handle, row1, col1);
	TERM_sendVT100Code(handle, _VT100_BACKGROUND_COLOR, _VT100_BLUE);
	ttprintf("\xE2\x95\x94"); //edge upper left
	int i = 0;
	for (i = 1; i < (col2 - col1); i++) {
		ttprintf("\xE2\x95\x90"); //=
	}
	ttprintf("\xE2\x95\x97"); //edge upper right
	for (i = 1; i < (row2 - row1); i++) {
		TERM_setCursorPos(handle, row1 + i, col1);
		ttprintf("\xE2\x95\x91"); //left ||
		TERM_setCursorPos(handle, row1 + i, col2);
		ttprintf("\xE2\x95\x91"); //right ||
	}
	TERM_setCursorPos(handle, row2, col1);
	ttprintf("\xE2\x95\x9A"); //edge lower left
	for (i = 1; i < (col2 - col1); i++) {
		ttprintf("\xE2\x95\x90"); //=
	}
	ttprintf("\xE2\x95\x9D"); //edge lower right
	TERM_sendVT100Code(handle, _VT100_FOREGROUND_COLOR, _VT100_WHITE);
}

void TERM_setCursorPos(TERMINAL_HANDLE * handle, uint16_t row, uint16_t column){
    ttprintf(ESC_STR "[%i;%iH", row, column);
}

void TERM_sendVT100Code(TERMINAL_HANDLE * handle, uint16_t cmd, uint8_t var){
    switch(cmd){
        case _VT100_RESET:
            ttprintfEcho("%cc", 0x1b);
            break;
        case _VT100_CURSOR_BACK:
            ttprintfEcho("\x1b[D");
            break;
        case _VT100_CURSOR_FORWARD:
            ttprintfEcho("\x1b[C");
            break;
        case _VT100_CURSOR_POS1:
            ttprintfEcho("\x1b[H");
            break;
        case _VT100_CURSOR_END:
            ttprintfEcho("\x1b[F");
            break;
        case _VT100_FOREGROUND_COLOR:
            ttprintfEcho("\x1b[%dm", var+30);
            break;
        case _VT100_BACKGROUND_COLOR:
            ttprintfEcho("\x1b[%dm", var+40);
            break;
        case _VT100_RESET_ATTRIB:
            ttprintfEcho("\x1b[0m");
            break;
        case _VT100_BRIGHT:
            ttprintfEcho("\x1b[1m");
            break;
        case _VT100_DIM:
            ttprintfEcho("\x1b[2m");
            break;
        case _VT100_UNDERSCORE:
            ttprintfEcho("\x1b[4m");
            break;
        case _VT100_BLINK:
            ttprintfEcho("\x1b[5m");
            break;
        case _VT100_REVERSE:
            ttprintfEcho("\x1b[7m");
            break;
        case _VT100_HIDDEN:
            ttprintfEcho("\x1b[8m");
            break;
        case _VT100_ERASE_SCREEN:
            ttprintfEcho("\x1b[2J");
            break;
        case _VT100_ERASE_LINE:
            ttprintfEcho("\x1b[2K");
            break;
        case _VT100_FONT_G0:
            ttprintfEcho("\x1b(");
            break;
        case _VT100_FONT_G1:
            ttprintfEcho("\x1b)");
            break;
        case _VT100_WRAP_ON:
            ttprintfEcho("\x1b[7h");
            break;
        case _VT100_WRAP_OFF:
            ttprintfEcho("\x1b[7l");
            break;
        case _VT100_ERASE_LINE_END:
            ttprintfEcho("\x1b[K");
            break;
        case _VT100_CURSOR_BACK_BY:
            ttprintfEcho("\x1b[%dD", var);
            break;
        case _VT100_CURSOR_FORWARD_BY:
            ttprintfEcho("\x1b[%dC", var);
            break;
        case _VT100_CURSOR_SAVE_POSITION:
            ttprintfEcho("\x1b" "7");
            break;
        case _VT100_CURSOR_RESTORE_POSITION:
            ttprintfEcho("\x1b" "8");
            break;
        case _VT100_CURSOR_ENABLE:
            ttprintfEcho("\x1b[?25h");
            break;
        case _VT100_CURSOR_DISABLE:
            ttprintfEcho("\x1b[?25l");
            break;
        case _VT100_CURSOR_SET_COLUMN:
            ttprintfEcho(ESC_STR "[%i`", var);
            break;
        case _VT100_CLS:
            ttprintfEcho("\x1b[2J\033[1;1H");
            break;
        case _VT100_CURSOR_DOWN_BY:
            ttprintfEcho("\x1b[%dB", var);
            break;
            
