Koxx3/SmartESC_STM32_v2/m365/Src/TTerm.c
    }
}

//returns a static pointer to the requested VT100 code, so it can be used in printf without needing any free() call afterwards
const char * TERM_getVT100Code(uint16_t cmd, uint8_t var){
    //INFO this is deprecated since all of the VT100 functions are handled by the terminal now
    switch(cmd){
        case _VT100_RESET:
            return "\x1b" "C";
            
        case _VT100_CURSOR_BACK:
            return "\x1b[D";
            
        case _VT100_CURSOR_FORWARD:
            return "\x1b[C";
            
        case _VT100_CURSOR_POS1:
            return "\x1b[H";
            
        case _VT100_CURSOR_END:
            return "\x1b[F";
        case _VT100_FOREGROUND_COLOR:
            switch(var){
                case 0:
                    return "\x1b[30m";
                case 1:
                    return "\x1b[31m";
                case 2:
                    return "\x1b[32m";
                case 3:
                    return "\x1b[33m";
                case 4:
                    return "\x1b[34m";
                case 5:
                    return "\x1b[35m";
                case 6:
                    return "\x1b[36m";
                case 7:
                    return "\x1b[37m";
                default:
                    return "\x1b[30m";
            }
            
        case _VT100_BACKGROUND_COLOR:
            switch(var){
                case 0:
                    return "\x1b[40m";
                case 1:
                    return "\x1b[41m";
                case 2:
                    return "\x1b[42m";
                case 3:
                    return "\x1b[43m";
                case 4:
                    return "\x1b[44m";
                case 5:
                    return "\x1b[45m";
                case 6:
                    return "\x1b[46m";
                case 7:
                    return "\x1b[47m";
                default:
                    return "\x1b[40m";
            }
            
        case _VT100_RESET_ATTRIB:
            return "\x1b[0m";
            
        case _VT100_BRIGHT:
            return "\x1b[1m";
            
        case _VT100_DIM:
            return "\x1b[2m";
            
        case _VT100_UNDERSCORE:
            return "\x1b[4m";
            
        case _VT100_BLINK:
            return "\x1b[5m";
            
        case _VT100_REVERSE:
            return "\x1b[7m";
            
        case _VT100_HIDDEN:
            return "\x1b[8m";
            
        case _VT100_ERASE_SCREEN:
            return "\x1b[2J";
            
        case _VT100_ERASE_LINE:
            return "\x1b[2K";
            
        case _VT100_FONT_G0:
            return "\x1b(";
            
        case _VT100_FONT_G1:
            return "\x1b)";
            
        case _VT100_WRAP_ON:
            return "\x1b[7h";
            
        case _VT100_WRAP_OFF:
            return "\x1b[71";
            
        case _VT100_ERASE_LINE_END:
            return "\x1b[K";
            
        case _VT100_CURSOR_ENABLE:
            return "\x1b[?25h";
            break;
        case _VT100_CURSOR_DISABLE:
            return "\x1b[?25l";
            break;
        case _VT100_CURSOR_SET_COLUMN:
            return ESC_STR "[%i`";
            break;
        case _VT100_CLS:
            return "\x1b[2J\033[1;1H";
            break;
            
    }
    return "";
}

void TERM_attachProgramm(TERMINAL_HANDLE * handle, TermProgram * prog){
    handle->currProgram = prog;
}

void TERM_removeProgramm(TERMINAL_HANDLE * handle){
    handle->currProgram = 0;
}


#ifdef TERM_ENABLE_STARTUP_TEXT
const char TERM_startupText1[] = "            333333    666   555555\r\nmm mm mmmm     3333  66     55\r\nmmm  mm  mm   3333  666666  555555";
const char TERM_startupText2[] = "mmm  mm  mm     333 66   66    5555\r\nmmm  mm  mm 333333   66666  555555\r\n";
const char TERM_startupText3[] = "\tBuild: " __DATE__ " - " __TIME__ "";
#endif   
